Revit 2027 API
RebarBendingDetail.GetHost Method
 Gets a reference to the reinforcement element that this bending detail represents.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Reference GetHost(
	Element bendingDetail
)
Public Shared Function GetHost (
	bendingDetail As Element
) As Reference
public:
static Reference^ GetHost(
	Element^ bendingDetail
)
static member GetHost :
        bendingDetail : Element -> Reference
Parameters
bendingDetail Element
 The bending detail for which we want to get the host.
Return Value
Reference
 Returns a reference pointing to the reinforcement element represented by the input bending detail.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarBendingDetail Class
Autodesk.Revit.DB.Structure Namespace